src/test/resources/requests/EM_Create_ticket.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                <wsse:Username>em</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">em=123</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <ns3:createTicketRequest xmlns="http://cio.att.com/commonheader/v3" xmlns:ns2="http://tktsvc.aots.att.com/ticket" xmlns:ns3="http://aots.att.com/ticket/v1" xmlns:ns4="http://cio.att.com/CommonHeader/v1">
            <WSHeader>
                <WSContext>
                    <FromAppId>EM</FromAppId>
                    <SourceIPAddress>aotswjl.test.att.com</SourceIPAddress>
                </WSContext>
            </WSHeader>
            <ns3:createTicketInput>
                <ns2:RemoteAgentID>testsipscisc</ns2:RemoteAgentID>
                <ns2:ClientTicketNum></ns2:ClientTicketNum>
                <ns2:FunctionalArea>SD_HOSTING</ns2:FunctionalArea>
                <ns2:Log>
null - null</ns2:Log>
                <ns2:ProblemAbstract>Test||Test||Calling Features</ns2:ProblemAbstract>
                <ns2:ReptRequestType>Informational</ns2:ReptRequestType>
                <ns2:ReptSvcImpactFlag>No</ns2:ReptSvcImpactFlag>
                <ns2:Severity>5 - Normal</ns2:Severity>
                <ns2:TicketType>WEB</ns2:TicketType>
                <ns2:ReportedBy>SHIPRA KUMARI</ns2:ReportedBy>
                <ns2:ReportPhone>040259999</ns2:ReportPhone>
                <ns2:TicketSource>EM</ns2:TicketSource>
                <ns2:TroubleReptDescText>Test</ns2:TroubleReptDescText>
                <ns2:ReporterEmailAddr>shiprkum@in.ibm.com</ns2:ReporterEmailAddr>
                <ns2:LogUserID>testsipscisc</ns2:LogUserID>
                <ns2:LogUserName>SHIPRA KUMARI</ns2:LogUserName>
                <ns2:LogUserPhone>040259999</ns2:LogUserPhone>
                <ns2:ReporterEmailNotifyFlag>No</ns2:ReporterEmailNotifyFlag>
                <ns2:TroubleReportedLevel3DescText>Calling Features</ns2:TroubleReportedLevel3DescText>
                <ns2:DispatchAuthorized>N</ns2:DispatchAuthorized>
            </ns3:createTicketInput>
            <ns3:assetInput>
                <ns2:AssetID>UNKNOWN</ns2:AssetID>
                <ns2:AssetName></ns2:AssetName>
                <ns2:ClientName>ALIGHT</ns2:ClientName>
                <ns2:OrgGroup>ALIY_TLP</ns2:OrgGroup>
                <ns2:ReportedProduct></ns2:ReportedProduct>
                <ns2:ReptSvcLineDescText>UC Voice</ns2:ReptSvcLineDescText>
                <ns2:AssetType>Equipment</ns2:AssetType>
                <ns2:AssetPriority>Low</ns2:AssetPriority>
                <ns2:EndUserName>SHIPRA</ns2:EndUserName>
                <ns2:EndUserPhone>4025999900</ns2:EndUserPhone>
                <ns2:AccountQualifier>ATS</ns2:AccountQualifier>
                <ns2:AccountType>1</ns2:AccountType>
                <ns2:CountryCode>USA</ns2:CountryCode>
                <ns2:LocationDetailsInfoList>
                    <ns2:LocationDetailsInfo>
                        <ns2:LocationContactName>SHIPRA</ns2:LocationContactName>
                        <ns2:LocationContactPhone>4025999900</ns2:LocationContactPhone>
                        <ns2:LocationDetailsType>L</ns2:LocationDetailsType>
                    </ns2:LocationDetailsInfo>
                </ns2:LocationDetailsInfoList>
                <ns2:ResellerIndicator>N</ns2:ResellerIndicator>
            </ns3:assetInput>
            <ns3:createControlInput>
                <ns2:AssetLookupType>ASSET_ID</ns2:AssetLookupType>
                <ns2:CreateType>C</ns2:CreateType>
                <ns2:RetrieveAssetInfo>N</ns2:RetrieveAssetInfo>
                <ns2:CircuitFormat>S</ns2:CircuitFormat>
            </ns3:createControlInput>
        </ns3:createTicketRequest>
    </soap:Body>
</soap:Envelope>